Cases/sphere2.2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (14 0 0);

boundaryField
{
    inletWall
    {
        type           	 freestream;
        freestreamValue         $internalField;
    }

    outletWall
    {
        type            zeroGradient;
    }

    "sphere*"
    {
        type            fixedValue;
        value 		uniform (0 0 0);
    }

    sym
    {
        type            symmetry;
    }
    Wall
    {
    	type		slip;
    }
}

// ************************************************************************* //
