Cases/sphere2.2/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates pressure and viscous forces over specified patches for a case
    where the solver is incompressible (pressure is kinematic, e.g. m^2/s^2).

\*---------------------------------------------------------------------------*/


	
	
	
forceCoeffs1
{
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches	    ("sphere*");
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1000;           // Redundant for incompressible
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);  // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         20;
  
	lRef        	42;
	Aref        	1400;
		
    /*
    binData
    {
        nBin        20;          // output data into 20 bins
        direction   (1 0 0);     // bin direction
        cumulative  yes;
    }
    */
}

// ************************************************************************* //
